; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v5 ?v7)
             (pred_2 ?v2 ?v9)
             (pred_7 ?v5 ?v9)
             (pred_11 ?v10 ?v5 )
	     (pred_8 ?v5)
             (pred_10 ?v6)
             (pred_1 ?v2)
             (pred_3 ?v9)
             (pred_5 ?v5)
             (pred_6 ?v2)
             (pred_4 ?v5)
             (pred_12 ))



(:action op_4
:parameters (?v4 ?v8 ?v12 ?v13)
:precondition (and (pred_10 ?v4) (pred_10 ?v8) (pred_1 ?v12) (pred_3 ?v13)
          (pred_9 ?v4 ?v8) (pred_2 ?v12 ?v13)
                   (pred_7 ?v8 ?v13) (pred_8 ?v4) 
                   (pred_5 ?v8) (pred_6 ?v12))
:effect (and  (pred_4 ?v8) (not (pred_5 ?v8))))


(:action op_2
:parameters (?v4 ?v1)
:precondition (and (pred_10 ?v4) (pred_10 ?v1)
               (pred_8 ?v4) (pred_9 ?v4 ?v1) (pred_4 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v4))))

(:action op_1
:parameters (?v4 ?v12)
:precondition (and (pred_10 ?v4) (pred_1 ?v12) 
                  (pred_8 ?v4) (pred_11 ?v12 ?v4) (pred_12 ))
:effect (and (pred_6 ?v12)
   (not (pred_11 ?v12 ?v4)) (not (pred_12 ))))


(:action op_3
:parameters (?v4 ?v3 ?v11)
:precondition (and (pred_10 ?v4) (pred_1 ?v3) (pred_1 ?v11)
                  (pred_8 ?v4) (pred_6 ?v11) (pred_11 ?v3 ?v4))
:effect (and (pred_6 ?v3) (pred_11 ?v11 ?v4)
        (not (pred_6 ?v11)) (not (pred_11 ?v3 ?v4))))

(:action op_5
:parameters (?v4 ?v12)
:precondition (and (pred_10 ?v4) (pred_1 ?v12) 
                  (pred_8 ?v4) (pred_6 ?v12))
:effect (and (pred_12 ) (pred_11 ?v12 ?v4) (not (pred_6 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_04 obj_10 obj_14 obj_09 obj_13 obj_02 obj_15 obj_19 obj_05 obj_18 obj_08 obj_06 obj_11 obj_07 obj_03
    obj_16 obj_01
    obj_17 obj_20
    )

    (:init
       (pred_12)

       (pred_10 obj_12)
       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_19)
       (pred_10 obj_05)
       (pred_10 obj_18)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_11)
       (pred_10 obj_07)
       (pred_10 obj_03)
       (pred_3 obj_16)
       (pred_3 obj_01)
       (pred_1 obj_17)
       (pred_1 obj_20)

       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_04)
       (pred_9 obj_04 obj_13)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_12)
       (pred_9 obj_10 obj_02)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_14 obj_15)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_09 obj_13)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_13 obj_04)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_02 obj_10)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_14)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_19 obj_06)
       (pred_9 obj_19 obj_05)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_19)
       (pred_9 obj_18 obj_07)
       (pred_9 obj_18 obj_08)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_18)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_19)
       (pred_9 obj_11 obj_07)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_07 obj_18)
       (pred_9 obj_07 obj_11)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_03 obj_07)
       (pred_5 obj_14)
       (pred_5 obj_11)
       (pred_7  obj_14 obj_16)
       (pred_7  obj_11 obj_01)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_13)
       (pred_4 obj_02)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_05)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_03)

       (pred_2  obj_17 obj_16)
       (pred_2  obj_20 obj_01)
       (pred_11 obj_17 obj_13)
       (pred_11 obj_20 obj_09)
       (pred_8 obj_08)
    )

    (:goal (and
       (pred_11 obj_20 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_2 obj_08 obj_15)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_15)
   goals met: 0 of 1
2. (op_2 obj_15 obj_02)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_02)
   goals met: 0 of 1
3. (op_2 obj_02 obj_13)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_13)
   goals met: 0 of 1
4. (op_2 obj_13 obj_09)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_09)
   goals met: 0 of 1
5. (op_1 obj_09 obj_20)
   deleted: (pred_11 obj_20 obj_09) (pred_12)
   added: (pred_6 obj_20)
   goals met: 0 of 1
6. (op_2 obj_09 obj_19)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_06)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_06)
   goals met: 0 of 1
8. (op_4 obj_06 obj_11 obj_20 obj_01)
   deleted: (pred_5 obj_11)
   added: (pred_4 obj_11)
   goals met: 0 of 1
9. (op_2 obj_06 obj_11)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_11)
   goals met: 0 of 1
10. (op_5 obj_11 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_12) (pred_11 obj_20 obj_11)
   goals met: 1 of 1
